rule AD_account_enabled
{
	meta: 
		author = "The-Computer-Cowboy"
		subject = "AD account enabled"
		description = " This rule detects when an account is enabled in AD."
		tactic = ""
		technique = "User Account Modification"
		subtechnique = ""
		tool = ""
		datasource = "Active Directory"
		category = "User Account Management"
		product = ""
		logsource = "Windows Events"
		actor = ""
		malware = ""
		vulnerability = ""
		custom = ""
		confidence = "High"
		severity = "7"
		falsePositive = "Legitimate Administrator activity on user accounts."
		externalSubject = "0"
		externalMITRE = "0"
		version = "1"
		
	events:
		$e.metadata.product_event_type = "4722" //Looking for windows event id 4722 which is when an account is enabled.
		$e.security_result.action = "ALLOW"
		
		//Exclusions - Use only if need with reference lists
		not $e.principal.user.userid in %whitelisted_principal_users
		
condition:
	$e
}
